xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ArteryTek</vendor>
  <url></url>
  <name>AT32F435_437_DFP</name>
  <description>ArteryTek AT32F4 Series Device Support,Drivers</description>
  <releases>
    <release version="2.0.6" date="2022-02-11">
      Update for firmware library.
    </release>
    <release version="2.0.5" date="2021-12-31">
      Update for firmware library.
    </release>
    <release version="2.0.4" date="2021-12-17">
      Update for firmware library.
    </release>
    <release version="2.0.3" date="2021-11-26">
      Update for firmware library.
    </release>
    <release version="2.0.2" date="2021-11-15">
      Update for svd files and firmware library.
    </release>
    <release version="2.0.1" date="2021-09-06">
      Update for svd files and firmware library.
    </release>
    <release version="2.0.0" date="2021-08-01">
      First Release version of AT32F435_437 Device Family Pack.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ArteryTek</keyword>
    <keyword>AT32F435</keyword>
    <keyword>AT32F437</keyword>
    <keyword>AT32F4</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="AT32F43x Series" Dvendor="ArteryTek:143">
      <!--book name="Device/ARM/Documents/??_dgug.pdf"       title="?? Device Generic Users Guide"/-->
    <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
    <compile header="Device/Include/at32f435_437.h"/>

      <description>
AT32F4 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
AT32F4 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>    

      <!-- ************************  Subfamily 'AT32F435_437'  **************************** -->
      <subFamily DsubFamily="AT32F435">
      <processor  Dfpu="1" Dclock="288000000"/>
      <debug svd="SVD/AT32F435xx_v2.svd"/>
      <description>
AT32F435 - ARM Cortex-M4 Core
  Frequency up to 288 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 256KB up to 4032 KB
  SRAM size up to 512KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode
  Independent battery supply for real-calendar RTC and battry powered domain register

Advanced analog peripherals
  Up to 3 x 12bit ADC

Integrated peripherals interface
  Up to 8 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 3 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDT, 1 x RTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="105"/>
      <feature type="VCC"           n="2.60"    m="3.60"/>

      <!-- *************************  Device 'AT32F435CCT7'  ***************************** -->
      <device Dname="-AT32F435CCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435CCU7'  ***************************** -->
      <device Dname="-AT32F435CCU7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CCU7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435RCT7'  ***************************** -->
      <device Dname="-AT32F435RCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435RCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435VCT7'  ***************************** -->
      <device Dname="-AT32F435VCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435VCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

