xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
      <!-- *************************  Device 'AT32F435ZCT7'  ***************************** -->
      <device Dname="-AT32F435ZCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435ZCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435CGT7'  ***************************** -->
      <device Dname="-AT32F435CGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435CGU7'  ***************************** -->
      <device Dname="-AT32F435CGU7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CGU7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435RGT7'  ***************************** -->
      <device Dname="-AT32F435RGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435RGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435VGT7'  ***************************** -->
      <device Dname="-AT32F435VGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435VGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435ZGT7'  ***************************** -->
      <device Dname="-AT32F435ZGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435ZGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435CMT7'  ***************************** -->
      <device Dname="-AT32F435CMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435CMU7'  ***************************** -->
      <device Dname="-AT32F435CMU7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435CMU7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435RMT7'  ***************************** -->
      <device Dname="-AT32F435RMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435RMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

