xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
      <!-- *************************  Device 'AT32F435VMT7'  ***************************** -->
      <device Dname="-AT32F435VMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435VMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F435ZMT7'  ***************************** -->
      <device Dname="-AT32F435ZMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F435ZMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F435_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F435_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>
     </subFamily>

      <subFamily DsubFamily="AT32F437">
      <processor  Dfpu="1" Dclock="288000000"/>
      <debug svd="SVD/AT32F437xx_v2.svd"/>
      <description>
AT32F437 - ARM Cortex-M4 Core
  Frequency up to 288 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 256KB up to 4032 KB
  SRAM size up to 512KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode
  Independent battery supply for real-calendar RTC and battry powered domain register

Advanced analog peripherals
  Up to 3 x 12bit ADC

Integrated peripherals interface
  Up to 8 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 3 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDT, 1 x RTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="105"/>
      <feature type="VCC"           n="2.60"    m="3.60"/>

      <!-- *************************  Device 'AT32F437RCT7'  ***************************** -->
      <device Dname="-AT32F437RCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437RCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437VCT7'  ***************************** -->
      <device Dname="-AT32F437VCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437VCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437ZCT7'  ***************************** -->
      <device Dname="-AT32F437ZCT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437ZCT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"      startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_256.FLM"                start="0x08000000" size="0x40000"   default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437RGT7'  ***************************** -->
      <device Dname="-AT32F437RGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437RGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437VGT7'  ***************************** -->
      <device Dname="-AT32F437VGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437VGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437ZGT7'  ***************************** -->
      <device Dname="-AT32F437ZGT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437ZGT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_1024.FLM"               start="0x08000000" size="0x100000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_512.FLM"            start="0x1FFFC000" size="0x00200"   default="0"/>
      </device>

