xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
      <!-- *************************  Device 'AT32F437RMT7'  ***************************** -->
      <device Dname="-AT32F437RMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437RMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437VMT7'  ***************************** -->
      <device Dname="-AT32F437VMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437VMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

      <!-- *************************  Device 'AT32F437ZMT7'  ***************************** -->
      <device Dname="-AT32F437ZMT7">
        <compile header="Device/Include/at32f435_437.h"  define="AT32F437ZMT7"/>
        <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x3F0000"     startup="1"   default="1"/>
        <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x60000"      init   ="0"   default="1"/>
        <algorithm name="Flash/AT32F437_4032.FLM"               start="0x08000000" size="0x3F0000"  default="1"/>
        <algorithm name="Flash/AT32F437_USD_4096.FLM"           start="0x1FFFC000" size="0x01000"   default="0"/>
      </device>

     </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="AT32F435xx">
      <description>ArteryTek AT32F403A Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F435*"/>
      <require Cclass="Device" Cgroup="startup" />
    </condition>

    <condition id="AT32F437xx">
      <description>ArteryTek AT32F437 Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F437*"/>
      <require Cclass="Device" Cgroup="startup" />
    </condition>

    <condition id="AT32F435_437">
      <description>ArteryTek AT32F435_437 Devices</description>
      <accept condition="AT32F435xx"/>
      <accept condition="AT32F437xx"/>
    </condition>

    <condition id="AT32F435xx ARMCC">
      <description>ArteryTek AT32F435xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F435*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="AT32F437xx ARMCC">
      <description>ArteryTek AT32F437xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F437*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="AT32F435_437 CMSIS">
      <description>ArteryTek AT32F435_437 Devices and CMSIS-CORE</description>
      <require condition="AT32F435_437"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="at32f435_437_conf"/>    
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="crm"/>           
    </condition>

    <!-- AT32F435_437 STDPERIPHERALS CRM Conditions -->
    <condition id="AT32F435_437 STDPERIPHERALS CRM">
      <description>ArteryTek AT32F435_437 Standard Peripherals Drivers with CRM</description>
      <require condition="AT32F435_437 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="crm"/>
    </condition>

     <!-- AT32F435_437 STDPERIPHERALS MISC Conditions -->
    <condition id="AT32F435_437 STDPERIPHERALS MISC">
      <description>ArteryTek  AT32F435_437 Standard Peripherals Drivers with MISC</description>
      <require condition="AT32F435_437 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="misc"/>
    </condition>

     <!-- AT32F435_437 STDPERIPHERALS EVAL Conditions -->
    <condition id="AT32F435_437 STDPERIPHERALS EVB">
      <description>ArteryTek AT32F435_437 Standard Peripherals Drivers with EVB</description>
      <require condition="AT32F435_437 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="usart"/>
      <require Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="scfg"/>
    </condition>
  </conditions>

  <components>
  <!-- at32f435_437_firmware_library -->
    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="acc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Auto Clock Calibration (ACC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ACC
        </RTE_Components_h>
        <files>
          <!-- ACC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_acc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_acc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="adc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_adc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="can" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>CAN (CAN) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_can.c" attr="config" version="2.0.0" />
        </files>
    </component>

