xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="crc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_crc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="crm" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
        </RTE_Components_h>
        <files>
          <!-- CRM file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_crm.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_crm.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="dac" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Digital-to-Analog-to converter (DAC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_dac.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="debug" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
        </RTE_Components_h>
        <files>
          <!-- DEBUG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_debug.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_debug.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="dma" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_dma.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="dvp" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Digital Video Parallel Interface (DVP) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DVP
        </RTE_Components_h>
        <files>
          <!-- DEBUG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_dvp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_dvp.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="edma" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Enhance Direct Memory Access (DMA) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EDMA
        </RTE_Components_h>
        <files>
          <!-- EDMA file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_edma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_edma.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="emac" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Ethernet MAC (EMAC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EMAC
        </RTE_Components_h>
        <files>
          <!-- EMAC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_emac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_emac.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="ertc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Enhance Real-time Clock (ERTC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ERTC
        </RTE_Components_h>
        <files>
          <!-- ERTC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_ertc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_ertc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="exint" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
        </RTE_Components_h>
        <files>
          <!-- EXINT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_exint.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_exint.c" attr="config" version="2.0.0" />
        </files>
    </component>

