xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="flash" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
        </RTE_Components_h>
        <files>
          <!-- FLASH file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_flash.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_flash.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="gpio" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_gpio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="i2c" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Inter-integrated CiCRMit (I2C) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_i2c.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="misc" Cversion="2.0.0" condition="AT32F435_437 CMSIS">
      <description>MISC driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_misc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="pwc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
        </RTE_Components_h>
        <files>
          <!-- PWC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_pwc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_pwc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="qspi" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Quad SPI (QSPI) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_QSPI
        </RTE_Components_h>
        <files>
          <!-- QSPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_qspi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_qspi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="sdio" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>SD/SDIO MMC card host interface (SDIO) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_sdio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="spi" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_spi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="scfg" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>System config (SCFG) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SCFG
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_scfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_scfg.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="tmr" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>TMR driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
        </RTE_Components_h>
        <files>
          <!-- TIMER file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_tmr.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_tmr.c" attr="config" version="2.0.0" />
        </files>
    </component>

