xiaocainiao11111/x_track_learn/X-Track(注释版)/ArteryTek.AT32F435_437_DFP.2.0.6/ArteryTek.AT32F435_437_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="usart" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_usart.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="usb" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_usb.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_usb.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="wdt" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Watchdog timer(WDT) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
        </RTE_Components_h>
        <files>
          <!-- WDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_wdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_wdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="wwdt" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
        </RTE_Components_h>
        <files>
          <!-- WWDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_wwdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_wwdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f435_437_firmware_library" Csub="xmc" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS CRM">
      <description>External Memory Controller (XMC) driver for AT32F435_437 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_XMC
        </RTE_Components_h>
        <files>
          <!-- XMC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f435_437_xmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f435_437_xmc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <!-- Utilities AT32F435_437 -->
    <component Cclass="Device" Cgroup="evb" Csub="at-start-f435-437" Cversion="2.0.0" condition="AT32F435_437 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/at32f435_437_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/at32f435_437_board.c" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Config AT32F435_437 -->
    <component Cclass="Device" Cgroup="at32f435_437_conf" Cversion="2.0.0" condition="AT32F435_437 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/at32f435_437_conf.h" attr="config" version="2.0.0"/>
      </files>
    </component>

   <!-- Startup AT32F435_437  -->
    <component Cclass="Device" Cgroup="startup"   Cversion="2.0.0" condition="AT32F435_437">
      <description>System startup for ArteryTek AT32F435_437  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/at32f435_437.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_at32f435_437.s" attr="config" version="2.0.0" condition="AT32F435xx ARMCC"/>
        <file category="source" name="Device/Source/ARM/startup_at32f435_437.s" attr="config" version="2.0.0" condition="AT32F437xx ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_at32f435_437.c"    attr="config" version="2.0.0"/>
      </files>
    </component>
  </components>
</package>
